<!-- terraform cdk action for options with hash 89c1ccb2da3d64b997241499927ca750 -->
### ✅ Successfully planned Terraform CDK Stack 'cdktf'



<details><summary>Show Plan</summary>

```shell
... Output truncated to the last 65000 characters ...

          + service  = "hello-world"
                   }
                 + ingress_rule {
                     + hostname = "auth.jon77p.xyz"
                     + service  = "http://localhost:9443"

                     + origin_request {
                         + connect_timeout          = "30s"
                         + disable_chunked_encoding = false
                         + http2_origin             = false
                         + keep_alive_connections   = 100
                         + keep_alive_timeout       = "1m30s"
                         + no_happy_eyeballs        = false
                         + no_tls_verify            = true
                         + proxy_address            = "127.0.0.1"
                         + proxy_port               = 0
                         + tcp_keep_alive           = "30s"
                         + tls_timeout              = "10s"
                       }
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470" {
             + account_id = (sensitive value)
             + id         = (known after apply)
             + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://healthchecks:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/metrics$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + hostname = "healthchecks.jon77p.xyz"
                     + service  = "http://localhost:8000"
                   }
                 + ingress_rule {
                     + hostname = "healthchecks.thepi.cloud"
                     + service  = "http://localhost:8000"
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # oci_core_instance.oci1_oci1-tsadmin-compute_ubuntu_instance_A0B83375 will be destroyed
         - resource "oci_core_instance" "oci1_oci1-tsadmin-compute_ubuntu_instance_A0B83375" {
             - availability_domain         = "JFCW:US-SANJOSE-1-AD-1" -> null
             - boot_volume_id              = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhanhhvf45ffu55lyqu77fxcydz3voymwctkffuvnf6dwhcozr6va" -> null
             - compartment_id              = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda" -> null
             - defined_tags                = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:51.554Z"
               } -> null
             - display_name                = "tsadmin" -> null
             - extended_metadata           = {} -> null
             - fault_domain                = "FAULT-DOMAIN-2" -> null
             - freeform_tags               = {} -> null
             - hostname_label              = "tsadmin" -> null
             - id                          = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycavithayqw7pujtymixjzolzmvel7bi6r7ifhgj67e5rq" -> null
             - image                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> null
             - is_cross_numa_node          = false -> null
             - launch_mode                 = "PARAVIRTUALIZED" -> null
             - metadata                    = {
                 - "user_data" = (sensitive value)
               } -> null
             - preserve_boot_volume        = true -> null
             - private_ip                  = "10.0.0.137" -> null
             - public_ip                   = "146.235.224.77" -> null
             - region                      = "us-sanjose-1" -> null
             - shape                       = "VM.Standard.E2.1.Micro" -> null
             - state                       = "RUNNING" -> null
             - subnet_id                   = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaao5qcf5yu7mdu7bdpxdif2jv7xv35o4lx3whvmdfcvwqeiv2niqfa" -> null
             - system_tags                 = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> null
             - time_created                = "2025-01-19 19:26:52.223 +0000 UTC" -> null
               # (1 unchanged attribute hidden)

             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             - create_vnic_details {
                 - assign_ipv6ip             = false -> null
                 - assign_private_dns_record = true -> null
                 - assign_public_ip          = "true" -> null
                 - defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:51.711Z"
                   } -> null
                 - display_name              = "tsadmin" -> null
                 - freeform_tags             = {} -> null
                 - hostname_label            = "tsadmin" -> null
                 - nsg_ids                   = [] -> null
                 - private_ip                = "10.0.0.137" -> null
                 - skip_source_dest_check    = false -> null
                 - subnet_id                 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaao5qcf5yu7mdu7bdpxdif2jv7xv35o4lx3whvmdfcvwqeiv2niqfa" -> null
                   # (1 unchanged attribute hidden)
               }

             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             - shape_config {
                 - gpus                          = 0 -> null
                 - local_disks                   = 0 -> null
                 - local_disks_total_size_in_gbs = 0 -> null
                 - max_vnic_attachments          = 1 -> null
                 - memory_in_gbs                 = 1 -> null
                 - networking_bandwidth_in_gbps  = 0.47999998927116394 -> null
                 - nvmes                         = 0 -> null
                 - ocpus                         = 1 -> null
                 - processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> null
                 - vcpus                         = 2 -> null
                   # (3 unchanged attributes hidden)
               }

             - source_details {
                 - is_preserve_boot_volume_enabled = true -> null
                 - source_id                       = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhanhhvf45ffu55lyqu77fxcydz3voymwctkffuvnf6dwhcozr6va" -> null
                 - source_type                     = "bootVolume" -> null
                   # (3 unchanged attributes hidden)
               }
           }

         # oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci1_oci1-vault-compute_ubuntu_instance_3E6E0388" {
             + availability_domain                 = "JFCW:US-SANJOSE-1-AD-1"
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "vault"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + security_attributes                 = (known after apply)
             + security_attributes_state           = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "vault"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + security_attributes       = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaao5qcf5yu7mdu7bdpxdif2jv7xv35o4lx3whvmdfcvwqeiv2niqfa"
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + licensing_configs (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                 + is_preserve_boot_volume_enabled = true
                 + source_id                       = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
                 + source_type                     = "bootVolume"

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance) must be replaced
       -/+ resource "oci_core_instance" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A" {
             ~ boot_volume_id                      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             ~ defined_tags                        = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:50.588Z"
               } -> (known after apply)
             ~ extended_metadata                   = {} -> (known after apply)
             ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
             ~ freeform_tags                       = {} -> (known after apply)
             ~ hostname_label                      = "monitoring" -> (known after apply)
             ~ id                                  = "ocid1.instance.oc1.phx.anyhqljrvaxvekyckk553lt6nrrd26ytc6igrmfe3tgamakfo7zd2xbdf3bq" -> (known after apply)
             ~ image                               = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq" -> (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             ~ is_cross_numa_node                  = false -> (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
             ~ metadata                            = { # forces replacement
                 ~ "user_data" = (sensitive value)
               }
             ~ private_ip                          = "10.0.0.195" -> (known after apply)
             ~ public_ip                           = "141.148.179.120" -> (known after apply)
             ~ region                              = "phx" -> (known after apply)
             ~ security_attributes                 = {} -> (known after apply)
             ~ security_attributes_state           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.phx.aaaaaaaa3njbbln44appd5wxwc4b6zjqc4ebixa6y2kwyfaearqw64w3x5rq" -> (known after apply)
             ~ system_tags                         = {} -> (known after apply)
             ~ time_created                        = "2025-01-19 19:26:51.334 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:50.766Z"
                   } -> (known after apply)
                 ~ display_name              = "monitoring" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.195" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ licensing_configs (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 4 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
                 ~ vcpus                         = 4 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68" {
             + availability_domain                 = "EHXP:US-SANJOSE-1-AD-1"
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "auth"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + security_attributes                 = (known after apply)
             + security_attributes_state           = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "auth"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + security_attributes       = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaa3zjalanvxhb6mqcfjq4qn2olpcvsotdebd6oibhch6xsi6ys3wgq"
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + licensing_configs (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                 + is_preserve_boot_volume_enabled = true
                 + source_id                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                 + source_type                     = "image"

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_ubuntu_instance_BBB27590 will be destroyed
         - resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_ubuntu_instance_BBB27590" {
             - availability_domain         = "EHXP:US-SANJOSE-1-AD-1" -> null
             - boot_volume_id              = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr3j4hc6lg4kpq5dvvidejtpp2nevvp4p7vzyakpjygay2j3do6jeq" -> null
             - compartment_id              = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq" -> null
             - defined_tags                = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:52.678Z"
               } -> null
             - display_name                = "beszel-oci" -> null
             - extended_metadata           = {} -> null
             - fault_domain                = "FAULT-DOMAIN-2" -> null
             - freeform_tags               = {} -> null
             - hostname_label              = "beszel" -> null
             - id                          = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycaj2t5mn7wyolf2c2ugas25wlooa5xy3xkmvfackdefpa" -> null
             - image                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> null
             - is_cross_numa_node          = false -> null
             - launch_mode                 = "PARAVIRTUALIZED" -> null
             - metadata                    = {
                 - "user_data" = (sensitive value)
               } -> null
             - preserve_boot_volume        = true -> null
             - private_ip                  = "10.0.0.163" -> null
             - public_ip                   = "192.9.151.248" -> null
             - region                      = "us-sanjose-1" -> null
             - shape                       = "VM.Standard.E2.1.Micro" -> null
             - state                       = "RUNNING" -> null
             - subnet_id                   = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaa3zjalanvxhb6mqcfjq4qn2olpcvsotdebd6oibhch6xsi6ys3wgq" -> null
             - system_tags                 = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> null
             - time_created                = "2025-01-19 19:26:53.318 +0000 UTC" -> null
               # (1 unchanged attribute hidden)

             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             - create_vnic_details {
                 - assign_ipv6ip             = false -> null
                 - assign_private_dns_record = true -> null
                 - assign_public_ip          = "true" -> null
                 - defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:52.844Z"
                   } -> null
                 - display_name              = "beszel-oci" -> null
                 - freeform_tags             = {} -> null
                 - hostname_label            = "beszel" -> null
                 - nsg_ids                   = [] -> null
                 - private_ip                = "10.0.0.163" -> null
                 - skip_source_dest_check    = false -> null
                 - subnet_id                 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaa3zjalanvxhb6mqcfjq4qn2olpcvsotdebd6oibhch6xsi6ys3wgq" -> null
                   # (1 unchanged attribute hidden)
               }

             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             - shape_config {
                 - gpus                          = 0 -> null
                 - local_disks                   = 0 -> null
                 - local_disks_total_size_in_gbs = 0 -> null
                 - max_vnic_attachments          = 1 -> null
                 - memory_in_gbs                 = 1 -> null
                 - networking_bandwidth_in_gbps  = 0.47999998927116394 -> null
                 - nvmes                         = 0 -> null
                 - ocpus                         = 1 -> null
                 - processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> null
                 - vcpus                         = 2 -> null
                   # (3 unchanged attributes hidden)
               }

             - source_details {
                 - boot_volume_size_in_gbs         = "47" -> null
                 - boot_volume_vpus_per_gb         = "10" -> null
                 - is_preserve_boot_volume_enabled = true -> null
                 - source_id                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> null
                 - source_type                     = "image" -> null
                   # (1 unchanged attribute hidden)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A" {
             + availability_domain                 = "EHXP:US-SANJOSE-1-AD-1"
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "healthchecks"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + security_attributes                 = (known after apply)
             + security_attributes_state           = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "healthchecks"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + security_attributes       = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaa3zjalanvxhb6mqcfjq4qn2olpcvsotdebd6oibhch6xsi6ys3wgq"
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + licensing_configs (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                 + is_preserve_boot_volume_enabled = true
                 + source_id                       = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                 + source_type                     = "image"

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list) will be updated in-place
         ~ resource "oci_core_security_list" "oci0_oci0-base_security_list_3B303AEE" {
               id             = "ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaakxoapxhgeim262q2kxuoqhw4wum2vvphzztku424ppdi6yxsgqqq"
               # (7 unchanged attributes hidden)

             - ingress_security_rules {
                 - description = "Tailscale IPv4 direct connections" -> null
                 - protocol    = "17" -> null
                 - source      = "0.0.0.0/0" -> null
                 - source_type = "CIDR_BLOCK" -> null
                 - stateless   = false -> null

                 - udp_options {
                     - max = 41641 -> null
                     - min = 41641 -> null
                   }
               }

               # (5 unchanged blocks hidden)
           }

         # oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list) will be updated in-place
         ~ resource "oci_core_security_list" "oci1_oci1-base_security_list_86B45958" {
               id             = "ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaixfsq6zqills57he336pgwfbcnn243pcztk2heb4cjdpqtmphyaq"
               # (7 unchanged attributes hidden)

             - ingress_security_rules {
                 - description = "Tailscale IPv4 direct connections" -> null
                 - protocol    = "17" -> null
                 - source      = "0.0.0.0/0" -> null
                 - source_type = "CIDR_BLOCK" -> null
                 - stateless   = false -> null

                 - udp_options {
                     - max = 41641 -> null
                     - min = 41641 -> null
                   }
               }

               # (5 unchanged blocks hidden)
           }

         # oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list) will be updated in-place
         ~ resource "oci_core_security_list" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1" {
               id             = "ocid1.securitylist.oc1.phx.aaaaaaaaicpl5w3l7r56p3y7ln7obixj5znhibnnpkf4keh6rhytt3q3phvq"
               # (7 unchanged attributes hidden)

             - ingress_security_rules {
                 - description = "Tailscale IPv4 direct connections" -> null
                 - protocol    = "17" -> null
                 - source      = "0.0.0.0/0" -> null
                 - source_type = "CIDR_BLOCK" -> null
                 - stateless   = false -> null

                 - udp_options {
                     - max = 41641 -> null
                     - min = 41641 -> null
                   }
               }

               # (5 unchanged blocks hidden)
           }

         # oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list) will be updated in-place
         ~ resource "oci_core_security_list" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93" {
               id             = "ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaavi7xaicqnen2tnt2wmyj23hk7esd5k2m52mqcdtidhdt5wbv6doa"
               # (7 unchanged attributes hidden)

             - ingress_security_rules {
                 - description = "Tailscale IPv4 direct connections" -> null
                 - protocol    = "17" -> null
                 - source      = "0.0.0.0/0" -> null
                 - source_type = "CIDR_BLOCK" -> null
                 - stateless   = false -> null

                 - udp_options {
                     - max = 41641 -> null
                     - min = 41641 -> null
                   }
               }

               # (5 unchanged blocks hidden)
           }

         # random_id.oci1_oci1-tsadmin-tunnel_tunnel_secret_462BC67F will be destroyed
         - resource "random_id" "oci1_oci1-tsadmin-tunnel_tunnel_secret_462BC67F" {
             - b64_std     = "za+r8JNxhPQLcE0lp+2RzWBlq4M7ATNBuZljF67l4VXLJv4=" -> null
             - b64_url     = "za-r8JNxhPQLcE0lp-2RzWBlq4M7ATNBuZljF67l4VXLJv4" -> null
             - byte_length = 35 -> null
             - dec         = "1560860218713319614454026635461022075387529424869070483534382991568506529236678027006" -> null
             - hex         = "cdafabf0937184f40b704d25a7ed91cd6065ab833b013341b9996317aee5e155cb26fe" -> null
             - id          = "za-r8JNxhPQLcE0lp-2RzWBlq4M7ATNBuZljF67l4VXLJv4" -> null
           }

         # random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci1_oci1-vault-tunnel_tunnel_secret_48460AC7" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-tunnel_tunnel_secret_C7880423 will be destroyed
         - resource "random_id" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-tunnel_tunnel_secret_C7880423" {
             - b64_std     = "PB4E8FPhogih57RkiidJC61XEO2T+w7a5lplt4W2gFL9gBA=" -> null
             - b64_url     = "PB4E8FPhogih57RkiidJC61XEO2T-w7a5lplt4W2gFL9gBA" -> null
             - byte_length = 35 -> null
             - dec         = "456202876732394016351412894881998266910581934973943923075699440827678694591627624464" -> null
             - hex         = "3c1e04f053e1a208a1e7b4648a27490bad5710ed93fb0edae65a65b785b68052fd8010" -> null
             - id          = "PB4E8FPhogih57RkiidJC61XEO2T-w7a5lplt4W2gFL9gBA" -> null
           }

         # random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

       Plan: 36 to add, 5 to change, 7 to destroy.

       Changes to Outputs:
         - oci1_oci1-tsadmin-compute_boot-volumes_845C47D2                                                = {
             - availability_domain = "JFCW:US-SANJOSE-1-AD-1"
             - boot_volumes        = [
                 - {
                     - auto_tuned_vpus_per_gb        = ""
                     - autotune_policies             = []
                     - availability_domain           = "JFCW:US-SANJOSE-1-AD-1"
                     - backup_policy_id              = ""
                     - boot_volume_replicas          = []
                     - boot_volume_replicas_deletion = false
                     - cluster_placement_group_id    = ""
                     - compartment_id                = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
                     - defined_tags                  = {
                         - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                         - "Oracle-Tags.CreatedOn" = "2025-01-19T09:02:29.427Z"
                       }
                     - display_name                  = "tsadmin (Boot Volume)"
                     - freeform_tags                 = {}
                     - id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhanhhvf45ffu55lyqu77fxcydz3voymwctkffuvnf6dwhcozr6va"
                     - image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                     - is_auto_tune_enabled          = false
                     - is_hydrated                   = true
                     - kms_key_id                    = ""
                     - size_in_gbs                   = "47"
                     - size_in_mbs                   = "47694"
                     - source_details                = []
                     - state                         = "AVAILABLE"
                     - system_tags                   = {
                         - "orcl-cloud.free-tier-retained" = "true"
                       }
                     - time_created                  = "2025-01-19 09:02:31.593 +0000 UTC"
                     - volume_group_id               = ""
                     - vpus_per_gb                   = "10"
                   },
               ]
             - compartment_id      = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
             - filter              = [
                 - {
                     - name   = "display_name"
                     - regex  = true
                     - values = [
                         - "tsadmin",
                       ]
                   },
                 - {
                     - name   = "state"
                     - regex  = false
                     - values = [
                         - "AVAILABLE",
                       ]
                   },
               ]
             - id                  = "CoreBootVolumesDataSource-2062574658"
             - volume_group_id     = null
           } -> null
         - oci1_oci1-tsadmin-compute_instance-boot-volume_EE09C64B                                        = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhanhhvf45ffu55lyqu77fxcydz3voymwctkffuvnf6dwhcozr6va" -> null
         - oci1_oci1-tsadmin-compute_instance-display-name_C6534580                                       = "tsadmin" -> null
         - oci1_oci1-tsadmin-compute_instance-hostname_1769158E                                           = "tsadmin" -> null
         - oci1_oci1-tsadmin-compute_instance-source-details_77BAB5B1                                     = {
             - boot_volume_size_in_gbs              = ""
             - boot_volume_vpus_per_gb              = ""
             - instance_source_image_filter_details = []
             - is_preserve_boot_volume_enabled      = true
             - kms_key_id                           = ""
             - source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhanhhvf45ffu55lyqu77fxcydz3voymwctkffuvnf6dwhcozr6va"
             - source_type                          = "bootVolume"
           } -> null
         + oci1_oci1-vault-compute_boot-volumes_3DBAA598                                                  = {
             + availability_domain = "JFCW:US-SANJOSE-1-AD-1"
             + boot_volumes        = [
                 + {
                     + auto_tuned_vpus_per_gb        = ""
                     + autotune_policies             = []
                     + availability_domain           = "JFCW:US-SANJOSE-1-AD-1"
                     + backup_policy_id              = ""
                     + boot_volume_replicas          = []
                     + boot_volume_replicas_deletion = false
                     + cluster_placement_group_id    = ""
                     + compartment_id                = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
                     + defined_tags                  = {
                         + "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                         + "Oracle-Tags.CreatedOn" = "2024-09-17T18:02:34.112Z"
                       }
                     + display_name                  = "vault (Boot Volume)"
                     + freeform_tags                 = {}
                     + id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
                     + image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                     + is_auto_tune_enabled          = false
                     + is_hydrated                   = true
                     + kms_key_id                    = ""
                     + size_in_gbs                   = "47"
                     + size_in_mbs                   = "47694"
                     + source_details                = []
                     + state                         = "AVAILABLE"
                     + system_tags                   = {
                         + "orcl-cloud.free-tier-retained" = "true"
                       }
                     + time_created                  = "2024-09-17 18:02:35.681 +0000 UTC"
                     + volume_group_id               = ""
                     + vpus_per_gb                   = "10"
                     + xrc_kms_key_id                = ""
                   },
               ]
             + compartment_id      = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "vault",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = false
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = "CoreBootVolumesDataSource-2062574658"
             + volume_group_id     = null
           }
         + oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07                                          = (known after apply)
         + oci1_oci1-vault-compute_instance-display-name_F6EA6C63                                         = "vault"
         + oci1_oci1-vault-compute_instance-hostname_7D8AAC00                                             = "vault"
         + oci1_oci1-vault-compute_instance-source-details_49B43EF8                                       = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = true
             + kms_key_id                           = null
             + source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq"
             + source_type                          = "bootVolume"
           }
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_boot-volumes_E66EF43B              = {
             ~ boot_volumes        = [
                 ~ {
                       id                            = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq"
                     + xrc_kms_key_id                = ""
                       # (23 unchanged attributes hidden)
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2286997786"
               # (4 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-boot-volume_56D85552      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> (known after apply)
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-source-details_EBF73E6F   = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_boot-volumes_21834E5A                    = {
             + availability_domain = "EHXP:US-SANJOSE-1-AD-1"
             + boot_volumes        = []
             + compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "auth",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = false
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = "CoreBootVolumesDataSource-2744709155"
             + volume_group_id     = null
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0            = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-display-name_A0476686           = "auth"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-hostname_8249F6C5               = "auth"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA         = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = true
             + kms_key_id                           = nul
cdktf  l
             + source_id                            = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
             + source_type                          = "image"
           }
         - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_boot-volumes_F181D853                  = {
             - availability_domain = "EHXP:US-SANJOSE-1-AD-1"
             - boot_volumes        = [
                 - {
                     - auto_tuned_vpus_per_gb        = ""
                     - autotune_policies             = []
                     - availability_domain           = "EHXP:US-SANJOSE-1-AD-1"
                     - backup_policy_id              = ""
                     - boot_volume_replicas          = []
                     - boot_volume_replicas_deletion = false
                     - cluster_placement_group_id    = ""
                     - compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                     - defined_tags                  = {
                         - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                         - "Oracle-Tags.CreatedOn" = "2025-01-19T19:26:52.678Z"
                       }
                     - display_name                  = "beszel-oci (Boot Volume)"
                     - freeform_tags                 = {}
                     - id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr3j4hc6lg4kpq5dvvidejtpp2nevvp4p7vzyakpjygay2j3do6jeq"
                     - image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                     - is_auto_tune_enabled          = false
                     - is_hydrated                   = true
                     - kms_key_id                    = ""
                     - size_in_gbs                   = "47"
                     - size_in_mbs                   = "47694"
                     - source_details                = []
                     - state                         = "AVAILABLE"
                     - system_tags                   = {
                         - "orcl-cloud.free-tier-retained" = "true"
                       }
                     - time_created                  = "2025-01-19 19:26:56.212 +0000 UTC"
                     - volume_group_id               = ""
                     - vpus_per_gb                   = "10"
                   },
               ]
             - compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             - filter              = [
                 - {
                     - name   = "display_name"
                     - regex  = true
                     - values = [
                         - "beszel",
                       ]
                   },
                 - {
                     - name   = "state"
                     - regex  = false
                     - values = [
                         - "AVAILABLE",
                       ]
                   },
               ]
             - id                  = "CoreBootVolumesDataSource-2744709155"
             - volume_group_id     = null
           } -> null
         - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_instance-boot-volume_61DF3859          = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr3j4hc6lg4kpq5dvvidejtpp2nevvp4p7vzyakpjygay2j3do6jeq" -> null
         - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_instance-display-name_43FB9741         = "beszel-oci" -> null
         - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_instance-hostname_18B423F4             = "beszel" -> null
         - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-beszel-compute_instance-source-details_B70E9DD4       = {
             - boot_volume_size_in_gbs              = "47"
             - boot_volume_vpus_per_gb              = "10"
             - instance_source_image_filter_details = []
             - is_preserve_boot_volume_enabled      = true
             - kms_key_id                           = ""
             - source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr3j4hc6lg4kpq5dvvidejtpp2nevvp4p7vzyakpjygay2j3do6jeq"
             - source_type                          = "bootVolume"
           } -> null
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_boot-volumes_8751F307            = {
             + availability_domain = "EHXP:US-SANJOSE-1-AD-1"
             + boot_volumes        = []
             + compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "healthchecks",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = false
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = "CoreBootVolumesDataSource-2744709155"
             + volume_group_id     = null
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6    = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-display-name_03D6715F   = "healthchecks"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-hostname_AA05D714       = "healthchecks"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = true
             + kms_key_id                           = null
             + source_id                            = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
             + source_type                          = "image"
           }

       Post-plan Tasks:
cdktf  All tasks completed! 1 passed, 0 failed           (4s elapsed)

       │ Snyk ⸺   Passed
       │ No issues found.
       Severity threshold is set to low.
       │ Details: https://app.snyk.io/org/jon77p/project/0fe83cb2-98ca-4577-b078-fd048f4c1e02/history/2991796d-3e0a-444c-b8a0-727010ad8f6b
cdktf  │
       │
       │ Overall Result: Passed

       ------------------------------------------------------------------------
cdktf  ------------------------------------------------------------------------

       Cost Estimation:

       Resources: 0 of 66 estimated
                  $0.0/mo +$0.0
cdktf  ─────────────────────────────────────────────────────────────────────────────

       Note: You didn't use the -out option to save this plan, so Terraform can't
       guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>